
## Terraform Comment

**Project:** terraform/projects/mathews-mrr-stg

**Command:** plan

**Outcome:** success

<details>
  <summary>
    <b>Output: </b>
  </summary>

  <pre>module.service.google_project_service.main["artifactregistry.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/artifactregistry.googleapis.com]
module.service.google_project_service.main["run.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/run.googleapis.com]
module.service.google_project_service.main["iam.googleapis.com"]: Refreshing state... [id=mathews-mrr-stg/iam.googleapis.com]
module.dbt_project_bucket.google_storage_bucket.main: Refreshing state... [id=mathews-mrr-stg-dbt-project-bucket]
module.bigquery.google_bigquery_dataset.main: Refreshing state... [id=projects/mathews-mrr-stg/datasets/raw]
module.bigquery.google_bigquery_table.main["incomes"]: Refreshing state... [id=projects/mathews-mrr-stg/datasets/raw/tables/google_sheets__incomes]
module.dbt_project_sa.google_service_account.main: Refreshing state... [id=projects/mathews-mrr-stg/serviceAccounts/dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]
module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.user"]: Refreshing state... [id=mathews-mrr-stg/roles/bigquery.user/serviceAccount:dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]
module.dbt_project_sa.google_project_iam_member.main["roles/bigquery.dataEditor"]: Refreshing state... [id=mathews-mrr-stg/roles/bigquery.dataEditor/serviceAccount:dbt-project@mathews-mrr-stg.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.artifact_registry.google_artifact_registry_repository.main will be created
  + resource "google_artifact_registry_repository" "main" {
      + create_time      = (known after apply)
      + description      = "dbt Project Artifact Registry Repository"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "mathews-mrr-stg"
      + registry_uri     = (known after apply)
      + repository_id    = "dbt-project"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-images"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-last-n-versions"

          + most_recent_versions {
              + keep_count            = 3
              + package_name_prefixes = []
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: mathews-mrr-stg

To perform exactly these actions, run the following command to apply:
    terraform apply "mathews-mrr-stg"
</pre>
</details>
